Tekla.Structures.Internal.Channels.MainVersionInfo
FileVersion information

Tekla.Structures.Internal.Channels.MainProductName
Gets main product name, can be different for different Tekla Products

Tekla.Structures.Internal.Channels.FileVersion
File version so that each ipc  connection will always have a unique id

Tekla.Structures.Internal.Channels.CurrentProcess
The current process

Tekla.Structures.Internal.Channels.IsMainApplication
The process name

Tekla.Structures.Internal.Channels.CurrentProcessID
The process name

Tekla.Structures.Internal.Channels.SessionId
Session or User name based pipe

Tekla.Structures.Internal.Channels.GenerateUniqueRemotingChannel(System.String)
Generates a unique name id that takes into account user, and tekla structures version and process id
channelMainName: user defined name pipe
Returns: user define + unique version